tap "homebrew/bundle"
tap "homebrew/php"

# --------------------------------------------------
# Core CLI tools
# --------------------------------------------------
brew "git"
brew "gh"
brew "jq"
brew "ripgrep"
brew "fd"
brew "htop"
brew "watch"
brew "tree"
brew "starship"
brew "exa"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --------------------------------------------------
# PHP
# --------------------------------------------------
brew "php"        # latest stable
brew "php@8.2"    # legacy support
brew "composer"
brew "sphp"

# --------------------------------------------------
# Symfony
# --------------------------------------------------
brew "symfony-cli"

# --------------------------------------------------
# JavaScript / Frontend
# --------------------------------------------------
brew "nvm"

# --------------------------------------------------
# Containers & infra
# --------------------------------------------------
cask "docker"
brew "caddy"
brew "mkcert"

# --------------------------------------------------
# Database clients (not servers)
# --------------------------------------------------
brew "mysql-client"
brew "postgresql@16" # client tools only

# --------------------------------------------------
# GUI applications
# --------------------------------------------------
cask "iterm2"
cask "jetbrains-toolbox"
cask "cursor"
cask "dbeaver-community"
cask "postman"
cask "font-jetbrains-mono"
cask "handbrake"
cask "microsoft-teams"
cask "1password"
cask "ngrok"
